{
  "about": {
    "title": "Acerca de Juan Gomez",
    "description": "A veces escribo código. Otras veces, reescribo el código hasta que funciona perfectamente.",
    "present": {
      "name": "Desarrollador Full Stack",
      "content": "Como desarrollador de software, mi integridad y disciplina se complementan con una mentalidad emprendedora. La gran capacidad para trabajar en equipo se equilibra con un constante deseo de aprender y crecer. Me apasiona crecimiento personal y el estudio de manera autónoma. Actualmente, Soy Tecnólogo en Sistematización de Datos y me encuentro desarrollando la Tesis para obtener el título de Ingeniería Telemática en la Universidad Distrital de Bogotá."
    },
    "seepdf": "Ver pdf",
    "item1": "ESTUDIOS",
    "item2": "EXPERIENCIA LABORAL",
    "work": {
      "synergias": {
        "name": "Desarrollador Full Stack / Synergias",
        "date": "Jul 2023 - Actualmente",
        "content": "Actualmente, en mi cargo trabajo con el equipo de desarrollo bajo la metodología Scrum, haciendo uso de herramientas como Jira y la suite de Microsoft Office, en la parte del Backend se trabaja con el framework .NET en C#, en el lado del frontend se hace uso de React y SQLServer para la gestión de la base de datos. Aquí debo desarrollar nuevos módulos, dar soporte a los ya realizados tanto en. Net como en React, además debo crear scripts de base de datos dependiendo el requerimiento."
      },
      "cpr": {
        "name": "Desarrollador Full Stack / CPR Servicios y Consultoría SAS",
        "date": "Sep 2021 - Jul 2023",
        "content": "En CPR, utilicé frameworks como Angular, Node.js y .NET, con lenguajes como JavaScript, TypeScript, HTML y SCSS. Utilicé librerías de diseño como Angular Material, DevExtreme y Bootstrap, y bases de datos MySQL. También trabajé con herramientas como AWS (S3, EC2), Jenkins, SonarQube, Jira, HeidiSql y Slack."
      },
      "solredes": {
        "name": "Desarrollador Web / Solredes SAS",
        "date": "Ago 2020 - Sep 2021",
        "content": "Me centré principalmente en el desarrollo frontend. Durante este período, trabajé con una variedad de frameworks y lenguajes de programación, incluyendo JSF, Angular, React y Flutter, así como Java, JavaScript, TypeScript, HTML, XHTML, CSS y SCSS. Además, utilicé librerías de diseño como Angular Material, PrimeNG, PrimeFaces y PrimeReact, y bases de datos como MySQL, PostgreSQL y Oracle."
      }
    },
    "education": {
      "ing": {
        "name": "Ingeniería Telemática",
        "date": "2021 - Actualmente",
        "content": "Universidad Distrital Francisco José de Caldas \n Actualmente trabajando en un proyecto de grado"
      },
      "c_nodeJS": {
        "name": "Certificación Autenticación, Microservicios y Redis con NodeJS"
      },
      "c_react": {
        "name": "Certificación React.js"
      },
      "c_angular": {
        "name": "Certificación Autenticación con Angular"
      },
      "c_scrum": {
        "name": "Certificación Curso Profesional de Scrum"
      },
      "tec": {
        "name": "Tecnólogo en Sistematización de Datos",
        "content": "Universidad Distrital Francisco José de Caldas"
      },
      "sena": {
        "name": "Técnico en contabilidad"
      }
    },
    "titleTecno": "TECNOLOGÍAS",
    "skills": "Habilidades"
  },
  "header": {
    "home": "Inicio",
    "about": "Acerda de",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "index": {
    "title": "Hola 👋",
    "subtitle": "Soy Juan Carlos Gómez",
    "description": "Soy un apasionado y dedicado desarrollador de software enfocado en el desarrollo web."
  }
}
